jsayres82/PIC32_Shapeoko_Controller/Firmware/CNC.X/src/app/app_tasks/program_planner.c
  // Update previous path unit_vector and nominal speed
  memcpy(pl.previous_unit_vec, unit_vec, sizeof(unit_vec)); // pl.previous_unit_vec[] = unit_vec[]
  pl.previous_nominal_speed = block->nominal_speed;

  // Update buffer head and next buffer head indices
  block_buffer_head = next_buffer_head;
  next_buffer_head = next_block_index(block_buffer_head);

  // Update planner position
  memcpy(pl.position, target, sizeof(target)); // pl.position[] = target[]

////planner_recalculate();
}

// Reset the planner position vector (in steps). Called by the system abort routine.
void plan_set_current_position(int32_t x, int32_t y, int32_t z)
{
  pl.position[X_AXIS] = x;
  pl.position[Y_AXIS] = y;
  pl.position[Z_AXIS] = z;
}

// Re-initialize buffer plan with a partially completed block, assumed to exist at the buffer tail.
// Called after a steppers have come to a complete stop for a feed hold and the cycle is stopped.
void plan_cycle_reinitialize(int32_t step_events_remaining)
{
  block_t *block = &block_buffer[block_buffer_tail]; // Point to partially completed block

  // Only remaining millimeters and step_event_count need to be updated for planner recalculate.
  // Other variables (step_x, step_y, step_z, rate_delta, etc.) all need to remain the same to
  // ensure the original planned motion is resumed exactly.
  block->millimeters = (block->millimeters*step_events_remaining)/block->step_event_count;
  block->step_event_count = step_events_remaining;

  // Re-plan from a complete stop. Reset planner entry speeds and flags.
  block->entry_speed = 0.0;
  block->max_entry_speed = 0.0;
  block->nominal_length_flag = false;
  block->recalculate_flag = true;
  planner_recalculate();
}
